#+LATEX_CLASS: texMemo
#+LATEX_CLASS_OPTIONS: [letter,12pt]
#+LATEX_HEADER: \usepackage[english]{babel}
#+LATEX_HEADER: \usepackage{graphicx, blindtext}
#+LATEX_HEADER: \usepackage{url}


#+LATEX_HEADER: \memoto{Mr. Unknown}
#+LATEX_HEADER: \memofrom{Tom}
#+LATEX_HEADER: \memosubject{Some fancy subject}
#+LATEX_HEADER: \memodate{\today}

Adapted from http://www.oak-tree.us/2010/08/02/texmemo/

\maketitle


* Summary
* Justification
* Information provided by student

* build								   :noexport:

#+BEGIN_SRC emacs-lisp
(add-to-list 'org-latex-classes
             '("texMemo"
               "\\documentclass\{texMemo\}
\\usepackage[english]{babel}
\[NO-DEFAULT-PACKAGES]
\[NO-PACKAGES]
\[EXTRA]"))

  (let ((org-latex-title-command "") ; avoids getting \maketitle right after begin{document}
      (async nil)
      (subtreep nil)
      (visible-only nil)
      (body-only nil))

  (org-latex-export-to-latex async subtreep visible-only body-only
			     '(:with-author nil
			       :with-date nil
			       :with-title nil
			       :with-toc nil)))

(shell-command "pdflatex memos")

#+END_SRC

#+RESULTS:
: 0



